drivers/NVMSIM/test/fio/output/nvmrand/nvm-readRand-1-32k-2G-test
my_nvm_read_test: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=1
fio-3.1
Starting 1 thread

my_nvm_read_test: (groupid=0, jobs=1): err= 0: pid=3943: Thu Apr 30 20:21:19 2020
   read: IOPS=147k, BW=4592MiB/s (4815MB/s)(2048MiB/446msec)
    slat (usec): min=3, max=301, avg= 5.73, stdev= 6.76
    clat (nsec): min=390, max=167919, avg=594.30, stdev=2142.51
     lat (usec): min=4, max=317, avg= 6.40, stdev= 7.49
    clat percentiles (nsec):
     |  1.00th=[   426],  5.00th=[   438], 10.00th=[   446], 20.00th=[   450],
     | 30.00th=[   454], 40.00th=[   458], 50.00th=[   466], 60.00th=[   470],
     | 70.00th=[   478], 80.00th=[   494], 90.00th=[   588], 95.00th=[   692],
     | 99.00th=[  1272], 99.50th=[  2672], 99.90th=[ 22912], 99.95th=[ 37120],
     | 99.99th=[100864]
  lat (nsec)   : 500=81.37%, 750=15.65%, 1000=1.59%
  lat (usec)   : 2=0.80%, 4=0.21%, 10=0.06%, 20=0.16%, 50=0.13%
  lat (usec)   : 100=0.02%, 250=0.01%
  cpu          : usr=11.46%, sys=87.64%, ctx=1, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4592MiB/s (4815MB/s), 4592MiB/s-4592MiB/s (4815MB/s-4815MB/s), io=2048MiB (2147MB), run=446-446msec

Disk stats (read/write):
  nvm0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%