drivers/NVMSIM/test/fio/output/nvmrand/nvm-readRand-1-64k-2G-test
my_nvm_read_test: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
fio-3.1
Starting 1 thread

my_nvm_read_test: (groupid=0, jobs=1): err= 0: pid=3970: Thu Apr 30 20:21:27 2020
   read: IOPS=88.1k, BW=5505MiB/s (5773MB/s)(2048MiB/372msec)
    slat (usec): min=6, max=1122, avg=10.18, stdev=13.16
    clat (nsec): min=404, max=445190, avg=616.28, stdev=3010.39
     lat (usec): min=6, max=1134, avg=10.89, stdev=13.93
    clat percentiles (nsec):
     |  1.00th=[  418],  5.00th=[  426], 10.00th=[  434], 20.00th=[  442],
     | 30.00th=[  450], 40.00th=[  454], 50.00th=[  458], 60.00th=[  470],
     | 70.00th=[  486], 80.00th=[  524], 90.00th=[  692], 95.00th=[  756],
     | 99.00th=[ 1672], 99.50th=[ 3248], 99.90th=[22656], 99.95th=[32128],
     | 99.99th=[96768]
  lat (nsec)   : 500=76.02%, 750=18.82%, 1000=2.97%
  lat (usec)   : 2=1.39%, 4=0.36%, 10=0.09%, 20=0.20%, 50=0.13%
  lat (usec)   : 100=0.02%, 250=0.01%, 500=0.01%
  cpu          : usr=10.51%, sys=87.87%, ctx=4, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5505MiB/s (5773MB/s), 5505MiB/s-5505MiB/s (5773MB/s-5773MB/s), io=2048MiB (2147MB), run=372-372msec

Disk stats (read/write):
  nvm0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%