drivers/NVMSIM/test/fio/output/nvmrand/nvm-readRand-1-8k-2G-test
my_nvm_read_test: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
fio-3.1
Starting 1 thread

my_nvm_read_test: (groupid=0, jobs=1): err= 0: pid=3881: Thu Apr 30 20:21:08 2020
   read: IOPS=302k, BW=2362MiB/s (2477MB/s)(2048MiB/867msec)
    slat (nsec): min=1631, max=280033, avg=2427.19, stdev=4177.13
    clat (nsec): min=360, max=254901, avg=480.64, stdev=1678.51
     lat (usec): min=2, max=291, avg= 2.98, stdev= 4.74
    clat percentiles (nsec):
     |  1.00th=[  366],  5.00th=[  370], 10.00th=[  370], 20.00th=[  374],
     | 30.00th=[  390], 40.00th=[  394], 50.00th=[  394], 60.00th=[  398],
     | 70.00th=[  402], 80.00th=[  410], 90.00th=[  438], 95.00th=[  502],
     | 99.00th=[  780], 99.50th=[ 1240], 99.90th=[22144], 99.95th=[23424],
     | 99.99th=[78336]
   bw (  MiB/s): min= 2354, max= 2354, per=99.69%, avg=2354.77, stdev= 0.00, samples=1
   iops        : min=301411, max=301411, avg=301411.00, stdev= 0.00, samples=1
  lat (nsec)   : 500=94.93%, 750=3.97%, 1000=0.42%
  lat (usec)   : 2=0.31%, 4=0.08%, 10=0.02%, 20=0.16%, 50=0.11%
  lat (usec)   : 100=0.02%, 250=0.01%, 500=0.01%
  cpu          : usr=18.82%, sys=80.95%, ctx=6, majf=0, minf=3
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2362MiB/s (2477MB/s), 2362MiB/s-2362MiB/s (2477MB/s-2477MB/s), io=2048MiB (2147MB), run=867-867msec

Disk stats (read/write):
  nvm0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%