drivers/NVMSIM/test/fio/output/nvmrand/nvm-writeRand-1-32k-2G-test
my_nvm_write_test: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=1
fio-3.1
Starting 1 thread

my_nvm_write_test: (groupid=0, jobs=1): err= 0: pid=3952: Thu Apr 30 20:21:20 2020
  write: IOPS=128k, BW=4000MiB/s (4194MB/s)(2048MiB/512msec)
    slat (usec): min=3, max=308, avg= 6.69, stdev= 8.62
    clat (nsec): min=380, max=135249, avg=578.91, stdev=2012.48
     lat (usec): min=4, max=313, avg= 7.37, stdev= 9.38
    clat percentiles (nsec):
     |  1.00th=[  386],  5.00th=[  390], 10.00th=[  394], 20.00th=[  398],
     | 30.00th=[  406], 40.00th=[  418], 50.00th=[  426], 60.00th=[  434],
     | 70.00th=[  446], 80.00th=[  474], 90.00th=[  580], 95.00th=[  724],
     | 99.00th=[ 1608], 99.50th=[ 4384], 99.90th=[22912], 99.95th=[36096],
     | 99.99th=[86528]
   bw (  MiB/s): min= 3979, max= 3979, per=99.48%, avg=3979.38, stdev= 0.00, samples=1
   iops        : min=127342, max=127342, avg=127342.00, stdev= 0.00, samples=1
  lat (nsec)   : 500=83.92%, 750=11.55%, 1000=2.19%
  lat (usec)   : 2=1.52%, 4=0.29%, 10=0.13%, 20=0.21%, 50=0.15%
  lat (usec)   : 100=0.03%, 250=0.01%
  cpu          : usr=12.33%, sys=86.69%, ctx=57, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,65536,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4000MiB/s (4194MB/s), 4000MiB/s-4000MiB/s (4194MB/s-4194MB/s), io=2048MiB (2147MB), run=512-512msec

Disk stats (read/write):
  nvm0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%