drivers/NVMSIM/test/fio/output/nvmrand/nvm-writeRand-1-64k-2G-test
my_nvm_write_test: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
fio-3.1
Starting 1 thread

my_nvm_write_test: (groupid=0, jobs=1): err= 0: pid=3979: Thu Apr 30 20:21:28 2020
  write: IOPS=67.0k, BW=4188MiB/s (4392MB/s)(2048MiB/489msec)
    slat (usec): min=7, max=522, avg=13.56, stdev=13.46
    clat (nsec): min=416, max=210591, avg=691.89, stdev=2612.68
     lat (usec): min=7, max=538, avg=14.36, stdev=14.36
    clat percentiles (nsec):
     |  1.00th=[   430],  5.00th=[   442], 10.00th=[   446], 20.00th=[   454],
     | 30.00th=[   458], 40.00th=[   462], 50.00th=[   470], 60.00th=[   478],
     | 70.00th=[   516], 80.00th=[   604], 90.00th=[   748], 95.00th=[  1012],
     | 99.00th=[  2704], 99.50th=[  6816], 99.90th=[ 24704], 99.95th=[ 37120],
     | 99.99th=[138240]
  lat (nsec)   : 500=66.91%, 750=23.07%, 1000=4.93%
  lat (usec)   : 2=3.54%, 4=0.87%, 10=0.25%, 20=0.20%, 50=0.19%
  lat (usec)   : 100=0.01%, 250=0.02%
  cpu          : usr=5.53%, sys=93.24%, ctx=47, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4188MiB/s (4392MB/s), 4188MiB/s-4188MiB/s (4392MB/s-4392MB/s), io=2048MiB (2147MB), run=489-489msec

Disk stats (read/write):
  nvm0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%